outputs/joined.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="https://ws.negocio.registroHostelero.a19.gvdi.com">
   <soapenv:Header><wsa:Action xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">https://servicios.pre.ertzaintza.eus/A19/registroHostelero/EnvioFicheroXML</wsa:Action><wsa:MessageID xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">urn:uuid:6e4607d2-0d0d-4e15-86aa-91292320ed24</wsa:MessageID><wsa:To xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing">https://servicios.pre.ertzaintza.eus/A19/registroHostelero/EnvioFicheroXML</wsa:To><wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#">
            <wsse:BinarySecurityToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" wsu:Id="X509Certificate">
            </wsse:BinarySecurityToken>
            <Signature xmlns="http://www.w3.org/2000/09/xmldsig#" Id="Signature-2117099736">
                <SignedInfo>
                    <CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
                        <c14n:InclusiveNamespaces xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xenc "/>
                    </CanonicalizationMethod>
                    <SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
                    <Reference URI="#idBody">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature">
                                <c14n:InclusiveNamespaces xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xenc "/>
                            </Transform>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <DigestValue/>
                    </Reference>
                    <Reference URI="#idTimestampToken">
                        <Transforms>
                            <Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature">
                                <c14n:InclusiveNamespaces xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xenc "/>
                            </Transform>
                        </Transforms>
                        <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                        <DigestValue/>
                    </Reference>
                </SignedInfo>
                <SignatureValue/>
                <KeyInfo>
                    <wsse:SecurityTokenReference>
                        <wsse:Reference URI="#X509Certificate" ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509">
                            <Transforms>
                                <Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature">
                                    <c14n:InclusiveNamespaces xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="xenc "/>
                                </Transform>
                            </Transforms>
                            <DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
                            <DigestValue/>
                        </wsse:Reference>
                    </wsse:SecurityTokenReference>
                    <KeyValue/>
                </KeyInfo>
            </Signature>
        </wsse:Security>
    </soapenv:Header>
   <soapenv:Body>
      <ws:envioFicheroXML>
         <ws:cabecera>
            <!--Optional:-->
            <aplicacion>Z40</aplicacion>
            <!--Optional:-->
            <codigoArrendador>codigoBueno</codigoArrendador>
            <!--Optional:-->
            <tipoComunicacion>PV</tipoComunicacion>
         </ws:cabecera>
         <ws:solicitud>
<alt:peticion xmlns:alt="http://servicios.pre.ertzaintza.eus/Ertzaintza/ALOJADOS/A19/comunicacionPV">
  <solicitud>
    <codigoEstablecimiento>480354</codigoEstablecimiento>
    <comunicacion>
      <contrato>
        <referencia>string</referencia>
        <fechaContrato>2022-09-29</fechaContrato>
        <fechaEntrada>2022-09-19T01:18:33</fechaEntrada>
        <fechaSalida>2022-09-21T19:27:14+02:00</fechaSalida>
        <numPersonas>2</numPersonas>
        <numHabitaciones>1</numHabitaciones>
        <internet>false</internet>
        <pago>
          <tipoPago>EFECT</tipoPago>
          <fechaPago>2022-09-29</fechaPago>
        </pago>
      </contrato>
      <persona>
        <rol>VI</rol>
        <nombre>Juan</nombre>
        <apellido1>Garcia</apellido1>
        <apellido2>Garcia</apellido2>
        <tipoDocumento>NIF</tipoDocumento>
        <numeroDocumento>000000000T</numeroDocumento>
        <soporteDocumento>999999999</soporteDocumento>
        <fechaNacimiento>1999-01-01</fechaNacimiento>
        <nacionalidad>ESP</nacionalidad>
        <sexo>H</sexo>
        <direccion>
          <direccion>C/Serrano 127</direccion>
          <direccionComplementaria>Portal A. 2B</direccionComplementaria>
          <codigoMunicipio>28079</codigoMunicipio>
          <codigoPostal>28001</codigoPostal>
          <pais>ESP</pais>
        </direccion>
        <telefono>666666666</telefono>
        <correo>juangarcia@correo.es</correo>
      </persona>
      <persona>
        <rol>VI</rol>
        <nombre>Pedro</nombre>
        <apellido1>Garcia</apellido1>
        <apellido2>Fernandez</apellido2>
        <fechaNacimiento>2018-01-01</fechaNacimiento>
        <nacionalidad>ESP</nacionalidad>
        <sexo>H</sexo>
        <direccion>
          <direccion>C/Serrano 127</direccion>
          <direccionComplementaria>Portal A. 2B</direccionComplementaria>
          <codigoMunicipio>28079</codigoMunicipio>
          <codigoPostal>28001</codigoPostal>
          <pais>ESP</pais>
        </direccion>
        <telefono>666666666</telefono>
        <correo>juangarcia@correo.es</correo>
        <parentesco>12</parentesco>
      </persona>
    </comunicacion>
  </solicitud>
</alt:peticion>
	    </ws:solicitud>
      </ws:envioFicheroXML>
   </soapenv:Body>
</soapenv:Envelope>
